app/Controllers/AuthController.php

    public function register()
    {
        // Retrieve JSON data from the request body
        $data = $this->request->getJSON(true);

        // Set validation rules
        $validation = \Config\Services::validation();
        $validation->setRules([
            'fullname'  => 'required',
            'username'  => 'required',
            'email'     => 'required|valid_email',
            'password'  => 'required|min_length[6]'
        ]);

        // Run the validation
        if (!$validation->run($data)) {
            return $this->failValidationErrors($validation->getErrors());
        }

        // Check Existing Username
        $username = $data["username"];
        $existingUser = $this->userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1

            'password'  => password_hash($data['password'], PASSWORD_BCRYPT)
        ];

        $this->userModel->insert($user);
---
INSERT INTO `users` (`fullname`, `username`, `email`, `password`) VALUES ('Faizal Nurul Firdaus', 'admin', 'faizalnf1800@gmail.com', '$2y$10$fDWhTVtwHaD22/2pZLdwF.A.pUKVoCJqcpHn4Fk6gl7ESiHscU3ky')

    public function login()
    {
        // Retrieve JSON data from the request body
        $data = $this->request->getJSON(true);

        // Set validation rules
        $validation = \Config\Services::validation();
        $validation->setRules([
            'username' => 'required',
            'password' => 'required'
        ]);

        // Run the validation
        if (!$validation->run($data)) {
            return $this->failValidationErrors($validation->getErrors());
        }

        // Retrieve the user by username
        $user = $this->userModel->where('username', $data['username'])->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1

    private function blacklistToken($accessToken)
    {

        $data = [
            'token' => $accessToken
        ];
        $this->revokedTokenModel->insert($data);
---
INSERT INTO `revoked_tokens` (`token`) VALUES ('eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjoiMSIsImV4cCI6MTY5MTMyMzU4Nn0.dQlx--IEqdBYrDKVoeU-T6mTomUZ1Qqh5c2Ds3C_A2A')