app/Controllers/LapakController.php

    public function index()
    {
        $lapak = $this->lapakModel->findAll();
---
SELECT *
FROM `lapak`

    public function show($id = null)
    {
        $lapak = $this->lapakModel->find($id);
---
SELECT *
FROM `lapak`
WHERE `lapak`.`id` = '10'

    public function create()
    {
        $data = $this->request->getJSON(true);

        // Validate input data
        $validation =  \Config\Services::validation();
        $validation->setRules([
            'img_lapak' => 'required',
            'title_lapak' => 'required',
            'price' => 'required|numeric',
            'short_description' => 'required',
            'description_lapak' => 'required'
        ]);

        if (!$validation->run($data)) {
            return $this->failValidationErrors($validation->getErrors());
        }

        $this->lapakModel->insert($data);
---
INSERT INTO `lapak` (`img_lapak`, `title_lapak`, `price`, `short_description`, `description_lapak`) VALUES ('https://s3.ap-southeast-1.amazonaws.com/stream.orbit.co.id/content/uploads/2022/01/20175107/FlashDisk-Lexar-V40-Jumpdrive-16GB-USB-2.0.jpg', 'Jual Flashdisk Lexar 16GB Bekas', '30000', 'Dijual Flashdisk Lexar 16GB Bekas barang masih mulus', 'Dijual Flashdisk Lexar 16GB Bekas barang masih mulus dan berfungsi dengan baik')

    public function update($id = null)
    {
        $data = $this->request->getJSON(true);

        // Validate input data
        $validation =  \Config\Services::validation();
        $validation->setRules([
            'img_lapak' => 'required',
            'title_lapak' => 'required',
            'price' => 'required|numeric',
            'short_description' => 'required',
            'description_lapak' => 'required'
        ]);

        if (!$validation->run($data)) {
            return $this->failValidationErrors($validation->getErrors());
        }

        $lapak = $this->lapakModel->find($id);

        if (!$lapak) {
            return $this->failNotFound('Product not found.');
        }

        $this->lapakModel->update($id, $data);
---
SELECT *
FROM `lapak`
WHERE `lapak`.`id` = '10'
UPDATE `lapak` SET `img_lapak` = 'mencoba', `title_lapak` = 'mencoba', `price` = '5000', `short_description` = 'shortcoba', `description_lapak` = 'descriptioncoba'
WHERE `lapak`.`id` IN ('10')

    public function delete($id = null)
    {
        $product = $this->lapakModel->find($id);

        if (!$product) {
            return $this->failNotFound('Product not found.');
        }

        $this->lapakModel->delete($id);
---
SELECT *
FROM `lapak`
WHERE `lapak`.`id` = '10'
DELETE FROM `lapak`
WHERE `id` IN ('10')